# MirrorProjectSuccess Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..MirrorProjectSuccess Property
BuiltInFailures..::..EditingFailures Class See Also
---
[Action] command has successfully processed [Number] elements
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MirrorProjectSuccess { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MirrorProjectSuccess As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MirrorProjectSuccess {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace